{
  "document_title": "Electronic Commerce Act, 2081 (2025)",
  "preamble": "Whereas, it is expedient to make legal provisions to regulate, systematize and ensure the credibility of commercial transactions of goods or services carried out through information technology, Be it enacted by the Federal Parliament.",
  "parts": [
    {
      "part_number": "1",
      "part_title": "Preliminary",
      "articles": [
        {
          "article_number": "1",
          "article_title": "Short title and commencement:",
          "clauses": [
            "(1) This Act may be called as the \"Electronic Commerce Act, 2081 (2025)\".",
            "(2) This Act shall come into force on the 31st day of assent.",
            "(3) This Act shall be applicable throughout Nepal and shall also apply to any person residing or staying outside Nepal who provides goods or services within Nepal through electronic commerce."
          ]
        },
        {
          "article_number": "2",
          "article_title": "Definitions:",
          "clauses": [
            "Unless the subject or context otherwise requires, in this Act,-",
            "(a) \"Consumer\" means a person or institution that consumes or uses any goods or services in accordance with this Act.",
            "(b) \"Contract\" means the contract referred to in Section 7 of this Act.",
            "(c) \"Buyer\" means any person or institution that purchases any goods or services in accordance with this Act and the term shall also include their representative.",
            "(d) \"Delivery Service Provider\" means a person, firm, company or institution employed by a business for the purpose of transporting goods and the term shall also include their representative.",
            "(e) \"Inspection Officer\" means an inspection officer appointed or designated in accordance with the prevailing federal law relating to consumer protection.",
            "(f) \"Seller\" means a person, firm, company or institution that makes goods or services available for sale to the intermediary business entity in accordance with this Act and the term also includes a business entity engaged in list-based electronic commerce.",
            "(g) \"Intermediary Business Entity” means a person, firm, company or institution that facilitates the sale of goods or services of a seller to a purchaser through an electronic platform.",
            "(h) \"Ministry\" means the Ministry of Industry, Commerce and Supplies of the Government of Nepal.",
            "(i) \"Director General” means the Director General of the Department.",
            "(j) \"Goods\" means any substance made for use or consumption by a consumer, either singly or in combination, which does not cause harm, injury or any kind of adverse effect to health and the term also includes raw materials, colors, fragrances or chemicals used in the manufacture of such goods.",
            "(k) \"Electronic Platform\" means a system developed for the purpose of conducting transactions of goods or services through the collection, transmission or storage of information using websites, applications, software, internet, intranet or marketplace of social media through the use of electronic devices such as computers, mobile phones or similar devices.",
            "(l) \"Electronic Commerce (E-Commerce)\" means the process of buying or selling any goods or services through an electronic platform. Provided that, the use of an electronic platform for the purpose of providing information about or promoting goods or services shall not be deemed to constitute electronic commerce.",
            "(m) \"Department\" means the Department of Commerce, Supplies and Consumer Protection of the Government of Nepal.",
            "(n) \"Business Entity\" means an intermediary business entity or a business entity engaged in list-based electronic commerce.",
            "(o) \"List-Based Electronic Commerce Business Entity\" means a firm, company or institution that prepares a list of goods or services owned by it and sells such listed goods or services directly to consumers through an electronic platform.",
            "(p) \"Service\" means services related to electricity, drinking water, telephone, information technology, health, education and consultation, transportation, tourism, entertainment, transportation, sewerage maintenance, banking, insurance or other similar services and the term also includes legal, auditing, medical or engineering services."
          ]
        }
      ]
    },
    {
      "part_number": "2",
      "part_title": "Operation of Electronic Commerce",
      "articles": [
        {
          "article_number": "3",
          "article_title": "Engage in Electronic Commerce:",
          "clauses": [
            "(1) Any firm, company or institution duly registered and authorized to conduct trade in goods or services in accordance with the prevailing law may subject to this Act, engage in electronic commerce.",
            "(2) Notwithstanding anything contained in sub-section (1), any goods or services that are prohibited from being traded through electronic means by the prevailing law or as notified by the Government of Nepal through publication in the Nepal Gazette shall not be allowed to be traded through such electronic means."
          ]
        },
        {
          "article_number": "4",
          "article_title": "Establishment of Electronic Platform:",
          "clauses": [
            "(1) Every business entity conducting electronic commerce shall establish an electronic platform. Provided that, micro entrepreneurs or equivalent small-scale entrepreneurs shall not be hindered from engaging in electronic commerce through other electronic platforms.",
            "(2) The business entity shall on the platform pursuant to sub-section (1), disclose at least the following details in a manner that enables the buyer to make an informed decision at the time of purchase regarding the business or trade of the business entity :",
            "(a) Name of the electronic platform,",
            "(b) Name of the business, address, the registering authority and registration certificate number,",
            "(c) Details of the registered office, head office and branches or outlets of the business entity, if any,",
            "(d) In the case of a license obtained for conducting any specific type of business, the details thereof,",
            "(e) Specification as to whether the business is of an intermediary or list-based electronic commerce,",
            "(f) Value Added Tax registration number or Permanent Account Number,",
            "(g) Contact details including email, telephone, mobile number, telefax, social media address (link) to contact business entity and designated email, telephone and mobile number for customer service,",
            "(h) Email address, telephone or mobile number and address of the person or unit responsible for handling grievances, and",
            "(i) Listing number obtained upon being listed under the electronic commerce portal in accordance with Section 5.",
            "(3) If any changes occur in the information referred to in sub-section (2), the business entity shall update such information on its electronic platform within forty-eight hours from the time of such change.",
            "(4) The details referred to in sub-section (2) shall be provided in complete, clear, and easily accessible manner to the consumer."
          ]
        },
        {
          "article_number": "5",
          "article_title": "To be listed:",
          "clauses": [
            "(1) After establishing the electronic platform pursuant to section 4, the business entity shall submit an application through electronic means to be listed on the electronic commerce portal established by the Department, accompanied by the following details:",
            "(a) Name of the business, address, registering authority, and registration certificate number,",
            "(b) The name and identity details of the proprietor in case of a business entity registered as a private firm, of the partners in the case of a business entity registered as a partnership firm, and of the directors in the case of a company or institution,",
            "(c) Clear description of the business operated by the business entity,",
            "(d) Value Added Tax registration number or Permanent Account Number,",
            "(e) Telephone number, email address, social media address (link), and contact address of the business entity,",
            "(f) Number and location of branches or outlets, if any, and",
            "(g) Other details mentioned in the electronic portal.",
            "(2) Business entity who are conducting electronic commerce at the time of commencement of this Act shall submit an application for listing in the electronic portal as pursuant to sub-section (1) within three months from the date of commencement of this Act.",
            "(3) Pursuant to sub-section (1) or (2) of the date of receipt of the application for listing on the electronic portal, within seven days from the date of receipt of the application for listing on the electronic portal, the department shall give the information along with the number of such platform listing to the concerned business entity through electronic means.",
            "(4) After being listed in accordance with sub-section (3), upon any addition or reduction in its branches or outlets, the business entity shall update the details in the electronic portal within seven days from the date of such change."
          ]
        },
        {
          "article_number": "6",
          "article_title": "Details to be disclosed:",
          "clauses": [
            "A business entity shall disclose the following details regarding the goods or services traded through electronic commerce on its electronic platform:-",
            "(a) Details including the name, nature, design, trademark, shape or image or combination thereof, weight or underlying substance of the goods or services available for electronic commerce,",
            "(b) The final selling price including tax of the goods or services,",
            "(c) Details of any additional charges incurred for the delivery or transfer of the goods,",
            "(d) Information on precautions to be taken while using the goods or services,",
            "(e) Time and date for delivery of goods or services,",
            "(f) Methods or mode of payment of the price of goods or services,",
            "(g) Duration and conditions of any warranty or guarantee on the goods or services,",
            "(h) A person, firm, company or institution producing goods or providing services,",
            "(i) In case of any imported goods or services, the country where such goods or services are produced or processed,",
            "(j) Details of any conditions to be followed after the purchase and sale of goods or services,",
            "(k) Whether the purchased goods or services are returnable or non-returnable, and if returnable, the conditions and duration thereof,",
            "(l) If services are sold, the place of receiving the service and the conditions of sale of the service,",
            "(m) Whether a request placed by a buyer can be cancelled before the dispatch of goods or initiation of services, and details thereof,",
            "(n) Date of manufacture, expiry date, and other essential conditions applicable to the goods,",
            "(o) Key contractual terms in a language understandable to the general public, and",
            "(p) Mechanism for addressing customer reviews, ratings, grievances, and feedback."
          ]
        },
        {
          "article_number": "7",
          "article_title": "Deemed to be Contract:",
          "clauses": [
            "(1) Any transaction relating to goods or services conducted between a buyer and a business entity or a seller and a business entity concluded through electronic means pursuant to this act shall be deemed to be a valid contract in accordance with the prevailing laws and the parties to such contract shall be liable to fulfill any obligation arising thereto.",
            "(2) While entering into a contract pursuant to sub-section (1), the business entity shall in addition to the provisions prescribed by the prevailing laws relating to the provision, the contract shall stipulate necessary notice, terms and provisions relating to delivery, cancellation, return, exchange, warranty and guarantee, refund of the goods or services to the buyer."
          ]
        },
        {
          "article_number": "8",
          "article_title": "Payment in Electronic Commerce:",
          "clauses": [
            "(1) While carrying out electronic commerce pursuant to this Act, arrangements may be made for the buyer to make payment of the prescribed price of goods or services to the business entity or to the delivery service provider on behalf of the business entity, either prior to, during, or after the purchase or transfer of such goods or services. In such case, payment made to the delivery service provider shall be deemed as payment received by the business entity.",
            "(2) While making payment pursuant to sub-section (1), payment instruments in accordance with the prevailing federal laws relating to payment and settlement may be used.",
            "(3) Upon payment of the amount pursuant to sub-section (2) the electronic or physical invoice for the goods or services along with a receipt of payment shall be immediately provided to the buyer and a record thereof shall be maintained. Payment made in such a manner shall be deemed to have been duly made.",
            "(4) Notwithstanding anything contained elsewhere in this section, any purchase or sale of goods or services in foreign currency shall be subject to the prevailing federal laws."
          ]
        },
        {
          "article_number": "9",
          "article_title": "Delivery of Goods or Services:",
          "clauses": [
            "(1) The business entity shall deliver or cause to be delivered the requested goods or services to the buyer or buyer's representative at the designated location and on the specific date, time or within the period as specified in the contract entered into with the buyer.",
            "(2) While delivering goods or services pursuant to sub-section (1), if the buyer or their representative wishes to physically receive the goods or services from any sales center of the business, the business entity shall transfer the said goods or services to them at that center.",
            "(3) Where goods or services have been delivered pursuant to sub-section (1) or (2), such goods or services shall be deemed to have been duly delivered.",
            "(4) Notwithstanding anything contained in sub-section (2), if the buyer or the business entity desires to change the place, person, period or time of delivery of the goods requested by the buyer before the goods are dispatched, and both parties agree on such change the business entity shall deliver the goods at the changed place, to the changed person or within the changed period or time.",
            "(5) Where the place or period of delivery is changed pursuant to sub-section (4), the charges arising therefrom may be added or reduced by mutual agreement between the buyer and the business entity."
          ]
        },
        {
          "article_number": "10",
          "article_title": "Return of Goods or Services:",
          "clauses": [
            "(1) If any goods or services purchased by the buyer under this Act do not confirm to the description provided by the business pursuant to Section 6, the buyer may return such goods or services to the business entity without using or damaging them.",
            "(2) If the buyer wishes to return goods or services pursuant to sub-section (1), the business entity shall accept such goods or services back unconditionally.",
            "(3) Upon return of goods or services pursuant to sub-section (1), the business entity may at the buyer's request, provide another goods or services of equivalent value in exchange.",
            "(4) Where goods or services have been returned pursuant to sub-section (1), and the buyer refuses to accept another goods or services in exchange as pursuant to sub-section (3), the business entity shall refund the amount paid to the buyer, including applicable taxes, for the returned goods or services.",
            "(5) Other provisions relating to the return of goods or services shall be in accordance with the prevailing federal laws."
          ]
        },
        {
          "article_number": "11",
          "article_title": "Export and Import:",
          "clauses": [
            "(1) Subject to the prevailing federal laws, any person, firm, company, or institution may purchase and import goods or services from any foreign firm, company, or institution engaged in electronic commerce.",
            "(2) Where a business entity sells goods or services to any foreign person, firm, company or institution through an electronic platform operated within Nepal, such goods or services may be exported subject to the prevailing federal laws, upon ensuring payment through the banking system in accordance with the mutual contract."
          ]
        },
        {
          "article_number": "12",
          "article_title": "Confidentiality of Personal Information:",
          "clauses": [
            "(1) The business entity shall maintain the confidentiality of any personal information or identifying personal details of any individual related to electronic commerce.",
            "(2) The information required to be kept confidential pursuant to sub-section (1) shall not be disclosed to any person or used by the business entity except as permitted by the prevailing law. Provided that, the exchange of information related to the transaction between the buyer, business entity or delivery service provider involved in the purchase and sale of goods or services under the contract shall not be impeded.",
            "(3) The business entity shall not deprive any user the facility to access the platform, enter or modify their personal information or deactivate identity-related sources.",
            "(4) Any act done in contravention of sub-section (2), shall be subjected to punishment in accordance with the prevailing law."
          ]
        },
        {
          "article_number": "13",
          "article_title": "Prohibition on Sale and Distribution:",
          "clauses": [
            "(1) Notwithstanding anything contained elsewhere in this Act, if buying and selling of any specific type of goods or services requires a separate license or the fulfillment of certain conditions or procedures in accordance with the prevailing laws, such goods or services shall not be sold or transacted without obtaining such license or fulfilling such conditions or procedures.",
            "(2) Where any goods or services are sold without obtaining the license or fulfilling the terms and procedures pursuant to sub-section (1), action shall be taken in accordance with the prevailing federal law."
          ]
        }
      ]
    },
    {
      "part_number": "3",
      "part_title": "Liablity of Parties Involved in Electronic Commerce",
      "articles": [
        {
          "article_number": "14",
          "article_title": "Liability of Intermediary Business Entity:",
          "clauses": [
            "In addition to the obligations prescribed by the prevailing laws and elsewhere in this Act, the intermediary business entity shall have following liabilities:",
            "(a) To clearly and accurately mention, in accordance with Section 6, the details of the goods or services offered for sale on the electronic platform in a manner accessible to buyer and to trade only those goods or services as mentioned on such platform,",
            "(b) To maintain records of transactions of purchased and sold goods or services for the period prescribed by the prevailing laws related to taxation based on the nature of such goods or services,",
            "(c) To comply with or ensure compliance with the terms of any warranty or guarantee provided for sold goods or services for the specified duration,",
            "(d) Not to discriminate among goods or services of the same category made available for sale by different sellers on the electronic platform, nor to grant preferential treatment to any particular seller in respect of the sale of goods or services, Provided that, if any particular seller of goods or services of a similar nature are given special preference, such information shall be clearly indicated on the platform in a manner accessible to the buyer.",
            "(e) To enter into an agreement with the seller who provides the goods or services before listing such goods or services for sale on the electronic platform, and",
            "(f) To accept the return, exchange or refund of any goods or services provided or facilitated by oneself if the buyer wishes to return them in accordance with the prevailing law, notwithstanding any terms of the contract."
          ]
        },
        {
          "article_number": "15",
          "article_title": "Liabilities of a List-Based Electronic Commerce Business Entity:",
          "clauses": [
            "In addition to the obligations prescribed by the prevailing laws and elsewhere in this Act, the liabilities of a business entity engaged in list-based shall be as follows:",
            "(a) To display the details as referred to in Section 6, on its platform in a clear and accessible manner to the buyer,",
            "(b) To publish on its platform the information and notices required to be maintained in accordance with the prevailing laws,",
            "(c) Not to post or cause to be posted any review, rating or feedback regarding the quality or features of any goods or services listed for sale on the platform by impersonating oneself or any other person as a fictitious consumer,",
            "(d) While advertising goods or services offered for sale, not to present their actual features, usage methods or other details of such goods or services in a misleading manner to deceive the buyer or consumer,",
            "(e) To maintain records of transactions of purchased and sold goods or services for the period prescribed by the prevailing laws related to taxation, based on the nature of such transactions,",
            "(f) Except in cases of force majeure, to deliver the sold goods or provide the service within the predetermined time frame,",
            "(g) To comply with the conditions of any warranty or guarantee provided for the sold goods or services for the duration specified therein,",
            "(h) To accept the return, cancellation or discontinuation of any goods or services sold or agreed to be sold if it does not confirm to the display or mutual agreement or delivered later than the predetermined time or found to be defective and to refund the payment made by the concerned buyer for such goods or services, and",
            "(i) To bear liability in case any question arises regarding the authenticity of the goods or services sold, where a formal commitment has been made regarding such authenticity."
          ]
        },
        {
          "article_number": "16",
          "article_title": "Liabilities of the Seller:",
          "clauses": [
            "In addition to the obligations prescribed in accordance with the prevailing laws and elsewhere in this Act, the liabilities of the seller shall be as follows:",
            "(a) To enter into a written or electronic contract with the intermediary business entity prior to making any goods or services available for sale through the electronic platform of such intermediary,",
            "(b) To provide the intermediary business entity, in written or electronic form, with evidence of business registration in accordance with the prevailing laws, relevant documents, full name and address, mechanism for collecting and addressing consumer grievances, details regarding exchange, return or refund of goods or services, and details of permanent account number or value added tax registration,",
            "(c) To provide the intermediary business entity with the information required pursuant to Section 6 for each goods or services to be sold through the electronic platform,",
            "(d) Except in cases of force majeure, to deliver the goods sold or provide the services within the predetermined time,",
            "(e) Not to engage in any form of unfair trade practice while making goods or services available for sale through an intermediary business entity or in any other circumstance,",
            "(f) Not to post or cause to be posted any review, rating or feedback regarding the quality or features of any goods or services listed for sale on the platform by impersonating oneself or any other person as a fictitious consumer, and",
            "(g) To accept the return, cancellation or discontinuation of any goods or services sold or agreed to be sold as provided through the intermediary business entity, does not confirm to the display or mutual agreement or delivered later than the predetermined time or found to be defective and to refund the payment made by the concerned buyer for such goods or services."
          ]
        },
        {
          "article_number": "17",
          "article_title": "Liabilities of the buyer:",
          "clauses": [
            "(1) The buyer shall bear the liabilities according to the contract between the buyer and the business entity while purchasing goods or services through electronic means in accordance with this Act.",
            "(2) The buyer shall not do or cause any act with the intention of causing harm to anyone while carrying out electronic commerce in accordance with this Act.",
            "(3) The buyer shall check and confirm whether or not the goods or services purchased by electronic means have been received in accordance with the contract made in accordance with this Act, and if there is any grievances, the buyer shall lodge a complaint by electronic means as soon as possible."
          ]
        },
        {
          "article_number": "18",
          "article_title": "Liabilities related to transportation:",
          "clauses": [
            "(1) Notwithstanding anything contained in prevailing law, if there is a contract to deliver or transfer of goods or service to a designated person, place, and time as specified by the buyer, the liability to deliver or transfer such goods or services shall lie with the business entity.",
            "(2) For the purpose of delivery or transfer of goods or services pursuant to sub-section (1), the business entity may enter into a separate contract with a delivery service provider.",
            "(3) The obligations of the delivery service provider mentioned in the prevailing law on consumer protection shall be equally applicable to the delivery service provider under this Act.",
            "(4) Any act contrary to sub-section (3) shall be punishable under the prevailing consumer protection laws."
          ]
        },
        {
          "article_number": "19",
          "article_title": "Prohibition of Unfair Trade or Commercial Practices:",
          "clauses": [
            "(1) While conducting electronic commerce under this Act, no seller, business entity, or any other party shall engage in or cause to be engaged in any act deemed as an unfair trade or commercial practice under the prevailing laws.",
            "(2) Actions will be taken according to the prevailing laws if any act is done or caused to be done pursuant to sub-section (1)."
          ]
        },
        {
          "article_number": "20",
          "article_title": "No Exemption from Liability:",
          "clauses": [
            "Notwithstanding anything contained elsewhere in this Act, if any complaint is filed under Section 28 or grievance lodged under Section 33 in relation to any goods or services provided or sold through the electronic platform by the business entity, such entity shall not be exempted from addressing the complaint or grievance only on the basis that the goods or services were not manufactured, imported, or directly made available by them."
          ]
        }
      ]
    },
    {
      "part_number": "4",
      "part_title": "Offences and Punishment",
      "articles": [
        {
          "article_number": "21",
          "article_title": "Deemed to have committed an offence:",
          "clauses": [
            "Any person who commits or causes the following acts shall be deemed to have committed an offense under this Act:-",
            "(a) Conduct electronic commerce without establishing an electronic platform pursuant to Section 4,",
            "(b) Operate business without being listed pursuant to Section 5,",
            "(c) Conduct electronic commerce without disclosing details of goods or services pursuant to Section 6,",
            "(d) Fails to fulfill or violate liabilities pursuant to clause (a), (b) and (e) of Section 14, clause (a), (b), (e) and (f) of Section 15, and clause (a), (b), (c) and (d) of Section 16, or,",
            "(e) Fails to fulfill or violate liabilities pursuant to clause (c), (d) and (f) of Section 14, clause (c), (d), (g), (h) and (i) of Section 15, and clause (e), (f) and (g) of Section 16."
          ]
        },
        {
          "article_number": "22",
          "article_title": "Imposition of Fine:",
          "clauses": [
            "(1) In case of committing an offense under clause (a), (b), (c) or (d) of Section 21, the inspection officer may impose a fine ranging from twenty thousand rupees to one lakh rupees depending on the gravity of the offence.",
            "(2) The concerned party who is not satisfied with the fine imposed by the inspection officer according to sub-section (1), may file an appeal before the Director General within seven days from the date of receiving the order.",
            "(3) The Director General shall make a decision on the appeal received under sub-section (2) and the complaint received under Section 28 within thirty-five days and such decision shall be final."
          ]
        },
        {
          "article_number": "23",
          "article_title": "Punishment:",
          "clauses": [
            "(1) In case of committing or causing to be committed an offence under clause (e) of Section 21, a fine of fifty thousand to five lakh rupees or imprisonment for a term of six months to three years or both, depending on the gravity of the offence shall be imposed."
          ]
        },
        {
          "article_number": "24",
          "article_title": "Investigation and Filing of Case:",
          "clauses": [
            "(1) The inspection officer shall investigate offences punishable pursuant to Section 23,",
            "(2) Upon completion of the investigation under sub-section (1), the inspection officer shall send the case to the concerned public prosecutor for a decision on prosecution, and if a decision is made to prosecute, the inspection officer shall file the case in the relevant consumer court according to the prevailing law and in case such a court is not formed, in the relevant district court."
          ]
        },
        {
          "article_number": "25",
          "article_title": "Government of Nepal as Plaintiff:",
          "clauses": [
            "The Government of Nepal shall be the plaintiff in the case of offenses punishable pursuant to Section 23."
          ]
        },
        {
          "article_number": "26",
          "article_title": "Summary Procedure to Be Adopted:",
          "clauses": [
            "Proceedings and disposal of cases filed pursuant to Section 24 shall be conducted following the summary procedure as per the prevailing federal laws."
          ]
        }
      ]
    },
    {
      "part_number": "5",
      "part_title": "Miscellaneous",
      "articles": [
        {
          "article_number": "27",
          "article_title": "Monitoring and Inspection of Electronic Commerce:",
          "clauses": [
            "(1) The Department shall conduct Monitoring and inspection of electronic commerce.",
            "(2) In addition to sub-section (1), if there is a provision for monitoring and inspection of any goods or services by a separate body or official according to the prevailing law, the monitoring and inspection of such goods or services shall be done accordingly.",
            "(3) During the monitoring and inspection pursuant to sub-section (1) or (2), if any kind of defect is found in the electronic platform or related arrangements, the department or the monitoring and inspection authority or the officer may give necessary instructions and it shall be the duty of the business entity to comply with such instructions."
          ]
        },
        {
          "article_number": "28",
          "article_title": "Filing Complaints:",
          "clauses": [
            "(1) Any person who has information about the violation of this Act may lodge a complaint to the Director General or the Inspection Officer along with the information or evidence in their possession. Such complaint can also be filed through electronic means.",
            "(2) If the person making the complaint pursuant to sub-section (1) wishes to keep his/her name confidential, the name of such person shall be kept confidential.",
            "(3) Notwithstanding anything contained in sub-section (1), during the monitoring, if any business entity or anyone else is found to have committed any act contrary to this Act or if any complaint is received in this regard, the monitoring report or complaint shall also be treated as a complaint.",
            "(4) If further investigation is deemed necessary pursuant to sub-section (1) or (3), the Director General shall forward the complaint to the relevant inspection officer for action under this Act.",
            "(5) Upon the complaint received pursuant to sub-section (1), (3) or (4), the inspection officer shall investigate the complaint within six months and, if there is a subject to be fined, shall be fined and if there is a subject to be prosecuted, shall take action to prosecute the case in accordance with this Act.",
            "(6) If the action on the complaint received pursuant to this section is required to be done by any other authority, the director general or inspection officer shall send it in writing to the concerned authority for action as soon as possible.",
            "(7) Regarding the matter received in writing for action pursuant to sub-section (6), the concerned authority shall take action in accordance with the prevailing law and inform the department accordingly."
          ]
        },
        {
          "article_number": "29",
          "article_title": "Need for Coordination:",
          "clauses": [
            "While monitoring or inspecting electronic platforms or related arrangements, the Department shall coordinate with the designated regulatory authority of the Government of Nepal that regulates information technology-related matters in accordance with prevailing law, and shall conduct such work with subject matter experts."
          ]
        },
        {
          "article_number": "30",
          "article_title": "Standards to be followed:",
          "clauses": [
            "Any standards prescribed by the Government of Nepal's information technology regulatory authority for the improvement or upgrading of electronic platforms in accordance prevailing law shall be followed by concerned business entity."
          ]
        },
        {
          "article_number": "31",
          "article_title": "In accordance with the Consumer Protection Act:",
          "clauses": [
            "Unless otherwise mentioned in this Act, matters relating to the quality of goods or services, labeling, procedures and grounds for returning sold goods, pricing of goods or services, examination, inspection and monitoring procedures, consumer dispute resolution, compensation and basis for determining compensation, and consumer rights interests shall be governed by the prevailing law on consumer protection and shall apply mutatis mutandis to goods or services traded electronically under this Act."
          ]
        },
        {
          "article_number": "32",
          "article_title": "May give instructions:",
          "clauses": [
            "(1) The Department may give necessary instructions to business entity for effective operation and regulation of electronic commerce under this Act.",
            "(2) If there is provision for the regulation of any goods or services by a separate authority or official in accordance to the prevailing law, such authority or officer may also give instructions pursuant to sub-section (1).",
            "(3) It shall be the duty of the business entity to comply with the instructions pursuant to sub-section (1) or (2)."
          ]
        },
        {
          "article_number": "33",
          "article_title": "Grievance management:",
          "clauses": [
            "(1) If the buyer or consumer is not satisfied with the purchase or process of buying any goods or services from a business entity, they may lodge a complaint through electronic means, in writing, or in person to the person or unit responsible for handling grievances of the business entity.",
            "(2) Upon receiving such complaint pursuant to sub-section (1), the business entity shall register the complaint and immediately provide information about the complaint to the buyer or consumer through electronic or other means.",
            "(3) If a complaint is received pursuant to sub-section (1), the business entity shall investigate and decide on the complaint within fifteen days.",
            "(4) While investigating a complaint pursuant to sub-section (3), if it is necessary to seek additional information from the buyer or consumer in relation to the matter, the person or unit responsible for handling grievances may request such information.",
            "(5) The person or unit responsible for hearing the grievances shall give written information to the buyer or consumer within fifteen days from the date of receipt of the complaint, if the complaint of the buyer or consumer can be addressed, and if it cannot be addressed, the written information with the reason shall be provided.",
            "(6) The Business entity shall develop and implement an online redressal mechanism for grievance management in accordance with this clause."
          ]
        },
        {
          "article_number": "34",
          "article_title": "Deemed to be conducted by the business entity themselves:",
          "clauses": [
            "Any electronic commerce conducted by an employee, worker, or representative of the business entity on behalf of business entity shall be deemed to have been conducted by the business entity itself."
          ]
        },
        {
          "article_number": "35",
          "article_title": "Provision of Discounts, Facilities, or Concessions:",
          "clauses": [
            "The Government of Nepal may, by publishing a notice in the Nepal Gazette, provide necessary discounts, facilities, or concessions to micro, small or cottage industries that trade in or sell goods or services produced in Nepal through electronic platforms in quantities exceeding a threshold determined by the Ministry."
          ]
        },
        {
          "article_number": "36",
          "article_title": "Prosecution of the case in accordance with prevailing law shall not be hindered:",
          "clauses": [
            "If any act which is considered to be an offense under this Act is also considered to be an offense under other prevailing laws, prosecution under such other laws shall not be barred by this Act."
          ]
        },
        {
          "article_number": "37",
          "article_title": "Power to Frame Directives:",
          "clauses": [
            "The Ministry may frame necessary directives for the effective implementation of this Act."
          ]
        },
        {
          "article_number": "38",
          "article_title": "Assessment as to implementation of the Act:",
          "clauses": [
            "The Ministry shall assess the implementation of this Act within five years from its commencement and every five years thereafter, and shall submit the report to the relevant committees of both houses of the Federal Parliament."
          ]
        }
      ]
    }
  ],
  "schedules": []
}