{
  "document_title": "INTERNATIONAL FINANCIAL TRANSACTIONS ACT, 2054 (1998)",
  "preamble": "Preamble : Whereas, it is expedient to develop Nepal as a centre for international financial transactions to foster the economic development of the nation in the context of open, liberal and market oriented economic policies pursued by the country, and the globalization of international financial markets; and\nWhereas, it is expedient to regulate and manage the financial activities of international financial entities in Nepal,\nBe it enacted by Parliament in the Year-sixth year of the reign of His Majesty's King Birendra Bir Bikram Shah Dev .",
  "parts": [
    {
      "part_number": "1",
      "part_title": "General Provisions",
      "articles": [
        {
          "article_number": "1.",
          "article_title": "Short Title and Commencement:",
          "clauses": [
            "(1) This Act may be called \"International Financial Transactions Act, 1998\".",
            "(2) It shall come into force on such date as Government of Nepal may, by notification published in the Nepal Gazette, appoint."
          ]
        },
        {
          "article_number": "2.",
          "article_title": "Definitions:",
          "clauses": [
            "(a) \"International Financial Transaction\" means any financial transaction carried out by any license holder entity under this Act.",
            "(b) \"International Financial Entity\" means any financial entity as referred to in Section 4.",
            "(c) \"Promotion Board\" means the International Financial Transactions Promotion Board constituted under Section 9.",
            "(d) \"License\" means a license granted under Section 14 to carry out international financial transactions in accordance with this Act.",
            "(e) \"License holder Entity\" means an international financial entity authorized to carryout international financial transactions under this Act.",
            "(f) \"Accreditation Committee\" means the International Financial Transactions Accreditation Committee constituted under Section 11.",
            "(g) \"Person Resident of Nepal\" means any of the following persons:-",
            "(1) Nepalese Citizens other than those residing outside the Nepal for more than the prescribed period for the purpose of being engaged in any employment, doing any business or carrying out any other occupation, or for any other purpose,",
            "(2) Non-Nepalese citizens residing in the Nepal for more than the prescribed period for the purpose of being engaged in any employment, doing any business or carrying out any other occupation,",
            "(3) Any entity which has been registered in Nepal under the existing laws.",
            "(h) \"Prescribed\" or \"as prescribed\" means prescribed or as prescribed in Rules made under this Act."
          ]
        },
        {
          "article_number": "3.",
          "article_title": "License to be obtained:",
          "clauses": [
            "An international financial entity interested to carryout international financial transactions shall be required to obtain a license therefore from the Accreditation Committee in pursuant to Section 14."
          ]
        },
        {
          "article_number": "4.",
          "article_title": "Financial Entities that may be authorized to obtain License :",
          "clauses": [
            "(1) Only the following financial entities may be authorized to obtain licenses to carry out international financial transactions under this Act:",
            "(a) Foreign bank and trust companies,",
            "(b) International insurance and reinsurance companies,",
            "(c) Companies serving as the registered offices for foreign companies,",
            "(d) International holding and investment companies,",
            "(e) Administrative or regional offices established by foreign companies,",
            "(f) International trading companies,",
            "(g) International finance companies,",
            "(h) Foreign real estate holding companies,",
            "(i) Foreign Patent and royalty companies,",
            "(j) Foreign mutual funds,",
            "(k) International leasing companies,",
            "(l) International merchant banks,",
            "(m) Entities such as foreign partnership and trusts established as body corporate,",
            "(n) International sales transaction companies,",
            "(o) Foreign entities to allow nonresident pensions or deferred bonus plans,",
            "(p) International financial companies providing services like stock broker, underwriter, investment advisor, pension fund advisor.",
            "(2) Notwithstanding anything contained in Sub-section (1), in order to obtain a license under this Act, a financial entity should have been registered duly in any country outside the Nepal and engaged in international financial transactions at least for a period of three years.",
            "(3) Government of Nepal may, on the recommendation of the Promotion Board, and by notification published in the Nepal Gazette, make alterations, additions or deletion to the list of financial entities as referred to in Sub-section (1)."
          ]
        },
        {
          "article_number": "5.",
          "article_title": "Acts not to be done by International Financial Entities:",
          "clauses": [
            "(a) To purchase any kind of immovable property within the Nepal or to keep in their name otherwise,",
            "(b) To carry out any type of international financial transaction with any person resident of Nepal,",
            "(c) To purchase shares or debentures of any company incorporated in the Nepal under the existing laws,",
            "(d) To open an account in any commercial bank of Nepal: Provided that an account may be opened in any commercial bank with the permission of the Accreditation Committee for the purpose of running the day-to-day administrative business of the office up to such amount as may be fixed by the Accreditation Committee."
          ]
        },
        {
          "article_number": "6.",
          "article_title": "No restrictions on brining in Foreign Currencies :",
          "clauses": [
            "(1) No restriction of any kind shall be imposed on a license holder entity to bring in foreign currencies as may be required for international financial transactions.",
            "(2) No restriction of any kind imposed by the existing laws relating to foreign exchange shall apply in relation to a license holder entity."
          ]
        },
        {
          "article_number": "7.",
          "article_title": "Fund to be allowed repatriation :",
          "clauses": [
            "A license holder entity may repatriate outside the Nepal the foreign currencies earned by it by carrying out international financial transactions and the foreign currencies brought in by such entity for the purpose of carrying out international financial transactions : Provided that no property or capital accrued from any illicit or illegal act shall be allowed to be repatriated."
          ]
        },
        {
          "article_number": "8.",
          "article_title": "Nationalization not to be done:",
          "clauses": [
            "The capital or the property of any entity shall not be subjected to nationalization."
          ]
        },
        {
          "article_number": "9.",
          "article_title": "Foemation of Promotion Board:",
          "clauses": [
            "(1) An International Financial Transactions Promotion Board consisting of the following members shall be formed to promote international financial activities and develop Nepal as a centre for international financial transaction:",
            "(a) Minister or State Ministery of Finance -Chairperson",
            "(b) Chairperson, Finance Committee, the House of Representatives - Member",
            "(c) Vice-Chairperson, National Planning Commission - Member",
            "(d) Governor, Nepal Rastra Bank - Member",
            "(e) Secretary, Ministry of Finance - Member",
            "(f) Secretary, Ministry of Law and Justice - Member",
            "(g) A person nominated by Government of Nepal from among persons having experience in financial transactions - Member",
            "(2) The Promotion Board may invite national or foreign experts or advisors involved in international financial transactions to participate at its meeting as observers.",
            "(3) The tenure of office of the member nominated under Clause (g) of Sub-section (1) shall be two years.",
            "(4) An officer-level employee of Nepal Rastra Bank designated by the Promotion Board with the consent of the Nepal Rastra Bank shall act as the Secretary of the Promotion Board.",
            "(5) The working procedures of the meetings of the Promotion Board shall be as prescribed.",
            "(6) The members of the Promotion Board shall be entitled to receive such allowances and benefits as may be prescribed."
          ]
        },
        {
          "article_number": "10.",
          "article_title": "Functions, Duties and Powers of Promotion Board :",
          "clauses": [
            "The Promotion Board shall have the following functions, duties and powers :",
            "(a) To frame necessary policies for the promotion of international financial transactions,",
            "(b) To cooperate with Government of Nepal in the formulation of necessary laws so as to promote international financial transactions,",
            "(c) To maintain or cause to be maintained coordination among the concerned governmental, non-governmental and international entities in matters of international financial transactions,",
            "(d) To make necessary recommendations to Government of Nepal in respect of exemptions, facilities and concessions to be accorded to international financial entities for the purpose of establishing Nepal as an attractive centre for international financial transactions,",
            "(e) To hear appeals filed by any international financial entity against the suspension or revocation of its license by the Accreditation Committee,",
            "(f) To perform such other functions as may be deemed necessary for promoting international financial transactions."
          ]
        },
        {
          "article_number": "11.",
          "article_title": "Formation of Accreditation Committee :",
          "clauses": [
            "(1) An International Financial Transactions Accreditation Committee consisting of the following members shall be formed for the purpose of granting licenses to international financial entities to carry out international financial transactions, and for the purpose of regulating financial transactions to be carried out by such entities :",
            "(a) Governor, Nepal Rastra Bank -Chairperson",
            "(b) Secretary, Ministry of Finance - Member",
            "(c) Secretary, Ministry of Law and Justice - Member",
            "(d) One person nominated by Government of Nepal from among Chartered Accountants - Member",
            "(e) One person nominated by Government of Nepal from among Economists - Member",
            "(2) The Accreditation committee may invite national or foreign experts or advisors involved in international financial transactions to participate at its meetings as observers.",
            "(3) The tenure of office of the members nominated under Clauses (d) and (e) of Sub-section (1) shall be two years.",
            "(4) An officer-level employee of Nepal Rastra Bank as designated by the Accreditation Committee with the consent of the Nepal Rastra Bank shall act as Secretary of the Accreditation Committee.",
            "(5) The office of the Accreditation Committee shall be located at the Nepal Rastra Bank.",
            "(6) The working procedures of the meetings of the Accreditation Committee shall be as prescribed.",
            "(7) The members of the Accreditation Committee shall be entitled to receive such allowances and benefits as may be prescribed."
          ]
        },
        {
          "article_number": "12.",
          "article_title": "Functions, Duties and Powers of the Accreditation Committee:",
          "clauses": [
            "The Accreditation Committee shall, apart from the functions, duties and powers set forth elsewhere in this Act, have the following functions, duties and powers:-",
            "(a) To monitor and supervise the financial activities of license holder entities as to whether or not their international financial transaction activities are in line with the provisions of this Act or Rules made thereunder, or other prevailing laws relating to international financial transactions,",
            "(b) To make recommendations to the Promotion Board in respect of facilitates to be accorded to international financial entities for the purpose of making Nepal as an attractive centre for international financial transactions,",
            "(c) To make recommendations to the Promotion Board in respect of improvements to be made in the existing laws related with international financial transactions for the purpose of carrying out international financial transactions in an effective and well-managed manner,",
            "(d) To inquire as to whether or not a license holder entity is fulfilling the conditions required to be fulfilled under the provisions of this Act and to require it to fulfill them if they are found not to have been fulfilled,",
            "(e) To give necessary instructions to license holder entities in respect of international financial transactions.",
            "(f) To avail itself of the service of national or foreign experts or specialized agencies for the promotion and development of international financial transactions,",
            "(g) To comply with the instructions given from time to time by the Promotion Board,",
            "(h) To suspend or revoke, as may be required, the license obtained by any license holder entity in cases where it is in violation of the provisions of this Act or Rules made thereunder, or the existing laws relating to international financial transactions: Provided that, such an entity shall be given an opportunity to submit its explanation before such revocation.",
            "(i) To perform such other acts, as may be prescribed, for making international financial transactions effective."
          ]
        },
        {
          "article_number": "13.",
          "article_title": "Application for License:",
          "clauses": [
            "An international financial entity interested to carry out international financial transaction shall, for the purpose of obtaining license to carry out such financial transaction, submit an application to the Accreditation Committee in the format as prescribed along with the prescribed application fee, details and documentations."
          ]
        },
        {
          "article_number": "14.",
          "article_title": "Granting of License:",
          "clauses": [
            "If the Accreditation Committee, after the necessary inquiry made into an application submitted under Section 13 for obtaining license to carryout international financial transactions, deems it appropriate to grant a license to carryout international financial transactions, it shall, upon taking the prescribed amount of license fee, issue a license in the prescribed format setting out therein the necessary terms and conditions. If a license may not be issued, the applicant shall be informed thereof."
          ]
        },
        {
          "article_number": "15.",
          "article_title": "Information, Details and Documentations may be Demanded :",
          "clauses": [
            "The Accreditation Committee may, before issuing a license to any international financial entity under this Act, demand from such entity such information, details and documentations as it may deem necessary in connection with issuing a license for carrying out international financial transactions. It shall be the duty of the concerned international financial entity to furnish forthwith the information, details and documentations so requisted by the Accreditation Committee."
          ]
        },
        {
          "article_number": "16.",
          "article_title": "Renewal of License:",
          "clauses": [
            "A license issued under section 14 for carrying out international financial transaction shall be renewed every year. The license renewal fee and other provisions regarding renewal shall be as prescribed."
          ]
        },
        {
          "article_number": "17.",
          "article_title": "Secrecy to be maintained :",
          "clauses": [
            "(1) The Accreditation Committee shall maintain secrecy of all documents and information which are related with license holder entities and are in possession or control of the Accreditation Committee.",
            "(2) The Accreditation Committee shall not be compelled to produce any documents or information referred to in Sub-section (1) before any court, commission of inquiry, Commission for the Investigation of Abuse of Authority or committee of inquiry, nor shall it be compelled to leak otherwise the secrecy of such documents or information.",
            "(3) Notwithstanding anything contained in Sub-section (2), if there are sufficient grounds to prove that the documents or information related to the international financial transaction carried out by a licenseholder entity are connected with illicit narcotic drugs or illegal arms and ammunition, the court may, on the request of the prosecuting authority acting on behalf of Government of Nepal, give an order to have such documents and information produced before it."
          ]
        },
        {
          "article_number": "18.",
          "article_title": "Proceeds to be credited to the formed Fund:",
          "clauses": [
            "The charges and other proceeds received by the Accreditation Committee under this Act shall be credited to the Consolidated Fund."
          ]
        },
        {
          "article_number": "19.",
          "article_title": "Sub-Committees may be constituted:",
          "clauses": [
            "(1) The Promotion Board and the Accreditation Committee may formed sub-committees as may be required to conduct their business.",
            "(2) The functions, duties, powers, jurisdiction and procedures of the subcommittees formed under subsection (1) shall be as fixed by the Promotion Board or the Accreditation Committee constituting such subcommittees."
          ]
        },
        {
          "article_number": "20.",
          "article_title": "Cooperation to be Extended :",
          "clauses": [
            "All governmental agencies shall extend necessary cooperation to the Promotion Board or the Accreditation Committee in matters of conducting their business."
          ]
        },
        {
          "article_number": "21.",
          "article_title": "Delegation of Power :",
          "clauses": [
            "(1) The Promotion Board may delegate any or all of its powers under this Act, Rules or Bye-laws made thereunder to any of its member or the Accreditation Committee, as may be required.",
            "(2) The Accreditation Committee may delegate any or all of its powers under this Act, Rules or Bye-laws made thereunder to any of its member, a subcommittee or an employee of officer rank, as may be required: Provided that, the Accreditation Committee shall not be entitled delegate its power of issuing license for carrying out international financial transactions or of revoking or suspending it."
          ]
        },
        {
          "article_number": "22.",
          "article_title": "Contact with Government of Nepal :",
          "clauses": [
            "While maintaining contact with Government of Nepal, the Promotion Board shall proceed through the Ministry of Finance."
          ]
        },
        {
          "article_number": "23.",
          "article_title": "Power to make Rules and Bye-laws:",
          "clauses": [
            "(1) In order to carry out the objectives of this Act, Government of Nepal may make necessary Rules.",
            "(2) The Promotion Board may, subject to this Act and Rules made thereunder, make necessary Bye-laws, and such Bye-laws shall come into force upon approval by Government of Nepal."
          ]
        },
        {
          "article_number": "24.",
          "article_title": "Existing laws to Prevail:",
          "clauses": [
            "Matters governed by this Act shall be dealt with in accordance with this Act and matters not dealt with by this Act shall be governed by other international financial transactions-related existing laws."
          ]
        }
      ]
    }
  ],
  "schedules": []
}